In [22]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier

### Загрузите выборку из файла titanic.csv с помощью пакета Pandas.

In [52]:
data = pd.read_csv('titanic.csv', index_col='PassengerId')

In [53]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Оставьте в выборке четыре признака: класс пассажира (Pclass), цену билета (Fare), возраст пассажира (Age) и его пол (Sex).

In [54]:
data = data[['Pclass', 'Fare', 'Age', 'Sex', 'Survived']]

### Обратите внимание, что признак Sex имеет строковые значения.

In [55]:
data['Sex'] = data.Sex.astype("category").cat.codes
data.head()

             Pclass     Fare   Age  Sex  Survived
PassengerId
1                 3   7.2500  22.0    1         0
2                 1  71.2833  38.0    0         1
3                 3   7.9250  26.0    0         1
4                 1  53.1000  35.0    0         1
5                 3   8.0500  35.0    1         0

### Выделите целевую переменную — она записана в столбце Survived.
### В данных есть пропущенные значения — например, для некоторых пассажиров неизвестен их возраст. Такие записи при чтении их в pandas принимают значение nan. Найдите все объекты, у которых есть пропущенные признаки, и удалите их из выборки.

In [56]:
data = data.dropna()

In [57]:
y = data['Survived']
data = data.drop(['Survived'], axis=1)

In [58]:
data.head()

             Pclass     Fare   Age  Sex
PassengerId
1                 3   7.2500  22.0    1
2                 1  71.2833  38.0    0
3                 3   7.9250  26.0    0
4                 1  53.1000  35.0    0
5                 3   8.0500  35.0    1

In [59]:
y.head()

PassengerId
1    0
2    1
3    1
4    1
5    0
Name: Survived, dtype: int64

### Обучите решающее дерево с параметром random_state=241 и остальными параметрами по умолчанию (речь идет о параметрах конструктора DecisionTreeСlassifier).

In [60]:
dtc = DecisionTreeClassifier(random_state=241)

In [61]:
dtc.fit(data, y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=241,
            splitter='best')

### Вычислите важности признаков и найдите два признака с наибольшей важностью. Их названия будут ответами для данной задачи (в качестве ответа укажите названия признаков через запятую или пробел, порядок не важен).

In [62]:
dtc.feature_importances_

array([ 0.14000522,  0.30343647,  0.2560461 ,  0.30051221])

In [63]:
answer = 'Fare Sex'

In [64]:
with open('output.txt', 'w') as f:
    f.write(answer)